app/controllers/food_items_controller.rb

SELECT "food_items".* FROM "food_items" WHERE (name ILIKE '%%')
---
  def index
    if params[:search]
      @food_items = FoodItem.search(params[:search])

UPDATE "food_items" SET "view_count" = $1, "updated_at" = $2 WHERE "food_items"."id" = $3  [["view_count", 1], ["updated_at", 2017-06-18 11:45:55 UTC], ["id", 1]]
---
  def show
    if @food_item.view_count
      @food_item.view_count += 1
    else
      @food_item.view_count = 1
    end
    @food_item.save()

INSERT INTO "food_items" ("name", "description", "price", "section", "remote_image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @food_item = FoodItem.new(food_item_params)

    respond_to do |format|
      if @food_item.save

UPDATE "food_items" SET "price" = $1, "updated_at" = $2 WHERE "food_items"."id" = $3  [["price", #<BigDecimal:7fe8c53964e8,'0.3E5',9(18)>], ["updated_at", 2017-06-18 07:54:31 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @food_item.update(food_item_params)

SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_food_item
      @food_item = FoodItem.find(params[:id])