app/controllers/home_controller.rb

  def menu
      case params[:sort_by]
      when "alpha"
          @sort_string = "name ASC"
      when "pricelow"
          @sort_string = "price ASC"
      when "pricehigh"
          @sort_string = "price DESC"
      when "mostview"
           @sort_string = "view_count DESC"
      else
          @sort_string = ""
      end
  	 if params[:section]
  	 	@food_items = FoodItem.where(section: params[:section]).order(@sort_string)
  	 else
  	 	@food_items = FoodItem.all.order(@sort_string)
---
SELECT "food_items".* FROM "food_items" WHERE "food_items"."section" = $1 ORDER BY price ASC  [["section", "Breakfast"]]
SELECT "food_items".* FROM "food_items" ORDER BY view_count DESC