app/controllers/orders_controller.rb

  def show
    @food_item = FoodItem.find(@order.food_item)
    @order = Order.find(params[:id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @food_item = FoodItem.find(params[:food_id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("name", "food_item", "qty", "email", "address", "phone", "coupon_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"